import 'dart:developer';

import 'package:hive/hive.dart';
import 'package:flutter/material.dart';
import 'package:hive_flutter/hive_flutter.dart';
import 'package:loginpage_tz3/hive_collections/schedule_model.dart';
import 'package:loginpage_tz3/hive_collections/users_model.dart';
import 'package:loginpage_tz3/hive_collections/todo_model.dart';
import 'package:loginpage_tz3/hive_collections/session_model.dart';
import 'package:loginpage_tz3/pages/authorization/auth.dart';

import 'hive_service.dart';

class UseApi {

Future<void> parseInHive(String tabel) async {
  final h = HiveService();
  await h.userPlus("0000000", "user_admin@ya.ru", "0000000", "teacher", "Admin_name", "ЦТУТП", "ИУЦТ", "УВП-211");

  
  await h.addSession("0000000", "Асинхронное программирование", "Экзамен",
      "Лелейникова Е.М.", "5", "4", "2-й семестр");
  await h.addSession("0000000", "Дискретная математика", "Зачет",
      "Лелейникова Е.М.", "5", "Зачет", "2-й семестр");
  await h.addSession("0000000", "Английский Яз.", "Экзамен", "Лелейникова Е.М.",
      "5", "4", "3-й семестр");
  await h.addSession("0000000", "Китайский Яз.", "Зачет", "Лелейникова Е.М.",
      "5", "Зачет", "3-й семестр");
  await h.addSession("0000000", "Теория Вероятностей", "Экзамен",
      "Лелейникова Е.М.", "5", "4", "4-й семестр");
  await h.addSession("0000000", "Базы Данных", "Зачет", "Лелейникова Е.М.", "5",
      "Зачет", "4-й семестр");
  await h.addSession("0000000", "Базы Данных", "Экзамен", "Лелейникова Е.М.",
      "5", "4", "5-й семестр");
  await h.addSession("0000000", "Инженерная Графика", "Зачет",
      "Лелейникова Е.М.", "5", "Зачет", "5-й семестр");
  await h.addSession("0000000", "Операционные Системы 1", "Экзамен",
      "Лелейникова Е.М.", "5", "4", "6-й семестр");
  await h.addSession("0000000", "Операционные системы 2", "Экзамен",
      "Лелейникова Е.М.", "5", "4", "6-й семестр");
  await h.addSession("0000000", "Математика", "Экзамен", "Лелейникова Е.М.",
      "5", "4", "1-й семестр");
  await h.addSession("0000000", "Математика", "Экзамен", "Лелейникова Е.М.",
      "5", "4", "1-й семестр");
  await h.addSession("0000000", "Асинхронное программирование", "Экзамен",
      "Лелейникова Е.М.", "5", "4", "2-й семестр");
  await h.addSession("0000000", "Дискретная математика", "Зачет",
      "Лелейникова Е.М.", "5", "Зачет", "2-й семестр");

  await h.addSchedule2("1234", "пн", "12:50", 'Математика', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "пн", "12:50", 'Англ. Яз.', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вт", "12:50", 'Рус. Яз.', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вт", "12:50", 'Цифровые Технологии', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "ср", "12:50", 'Базы данных', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "ср", "12:50", 'Асинхронное программирование', 1,
      "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "чт", "12:50", 'Веб-приложения', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "чт", "12:50", 'Мобильные приложения', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2(
      "1234", "пт", "12:50", 'ИИ', 1, "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "пт", "12:50", 'Теория Графов', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "сб", "12:50", 'Дискретная математика', 1,
      "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "сб", "12:50", 'Японский язык', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вс", "12:50", 'Логистика Ж/Д', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вс", "12:50", 'Правоведение', 1, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "пн", "12:50", 'История Транспорта', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2(
      "1234", "пн", "12:50", 'ОБЖ', 2, "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2(
      "1234", "вт", "12:50", 'ОКТ', 2, "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2(
      "1234", "вт", "12:50", 'ВУЦ', 2, "9:30", "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "ср", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "ср", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "чт", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "чт", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "пт", "12:50", 'Биомедицинские Технологии', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "пт", "12:50", 'Физика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "сб", "12:50", 'Проектная Деятельность', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "сб", "12:50", 'Проектная Деятельность', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вс", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  await h.addSchedule2("1234", "вс", "12:50", 'Математика', 2, "9:30",
      "Васиьлькова Т.А.", "Лекция");
  //caching info updated from server 
}
}

  Future<List<Map<String, dynamic>>> listNews() async {
    List<Map<String, dynamic>> news = [
    {
      "postTime": "6 апр в 11:00",
      "postText":
          "Команда Российского университета транспорта стала бронзовым призёром логистического турнира.",
      "postImage": "assets/image/logistic_news.jpeg"
    },
    {
      "postTime": '7 апр в 14:30',
      "postText": "Продолжается регистрация на кейс-чемпионат «PRO СТРОЙ»",
      "postImage": "assets/image/case_news.jpeg"
    },
    {
      "postTime": '12 апр в 10:00',
      "postText":
          "Финал Высшей студенческой квиз-лиги «Учись, студент!» прошёл 14 апреля в Новой Государственной Третьяковской галерее.",
      "postImage": "assets/image/learn_student_news.jpeg"
    },
    {
      "postTime": '15 апр в 19:00',
      "postText":
          "Благотворительный фонд «Система» при поддержке Минобрнауки России проводит стипендиальную программу «Система».",
      "postImage": "assets/image/system_news.jpeg"
    },
  ];
  return news;
  }
